Revit 2027 API
BuiltInFailures.SketchFailures.OpenAreaLoadLoop Property
 Area Load Sketch can't contain open loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenAreaLoadLoop { get; }
Public Shared ReadOnly Property OpenAreaLoadLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenAreaLoadLoop {
	FailureDefinitionId^ get ();
}
static member OpenAreaLoadLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace